app/controllers/admin/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages` WHERE (`pages`.parent_id = 4) ORDER BY virtual DESC, title ASC LIMIT 0, 20
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 9)