app/controllers/admin/sermons_controller.rb

SELECT * FROM `sermons` ORDER BY date DESC
---
  def index
    @sermons = Sermon.all :order => "date DESC"

UPDATE `sermons` SET `updated_at` = '2010-06-17 02:53:32', `notes` = 'By faith Rahab the prostitute received the spies in peace and didn\'t perish with those who disobeyed.\r\n-Hebrews 11:31\r\n\r\ntest123' WHERE `id` = 20
---
  def update
    @sermon = Sermon.find_by_permalink(params[:id])

    respond_to do |format|
      if @sermon.update_attributes(params[:sermon])