app/controllers/announcements_controller.rb

SELECT * FROM "announcements"
---
  def index
    @announcements = Announcement.all