app/controllers/sermons_controller.rb

SELECT * FROM `sermons` WHERE (`sermons`.`published` = 1) ORDER BY date DESC
---
  def index
    @sermons = Sermon.all :conditions => { :published => 1 }, :order => "date DESC"

SELECT * FROM `sermons` WHERE (`sermons`.`id` = 20)
---
  def show
    @sermon = Sermon.find(params[:id])