app/controllers/sermons_controller.rb

  def show
    @sermon = Sermon.find_by_permalink(params[:id])
---
SELECT * FROM `sermons` WHERE (`sermons`.`permalink` = 'rahab-the-faithful-mother') LIMIT 1